[
  {
    "title": "CIRA Guide to Custom Loss Functions for Neural Networks in Environmental Sciences",
    "abstract": "Neural networks are increasingly used in environmental science applications. Furthermore, neural network models are trained by minimizing a loss function, and it is crucial to choose the loss function very carefully for environmental science applications, as it determines what exactly is being optimized. Standard loss functions do not cover all the needs of the environmental sciences, which makes it important for scientists to be able to develop their own custom loss functions so that they can implement many of the classic performance measures already developed in environmental science, including...",
    "authors": "Imme Ebert-Uphoff, Ryan Lagerquist, Kyle Hilburn, Yoonjin Lee, Katherine Haynes, Jason Stock, Christina Kumler, Jebb Q. Stewart",
    "pdf": "https://arxiv.org/abs/2106.09757",
    "conference": ""
  },
  {
    "title": "Using Machine Learning to Improve Vertical Profiles of Temperature and Moisture for Severe Weather Nowcasting",
    "abstract": "Vertical profiles of temperature and moisture as provided by radiosondes are of paramount importance to forecasting convective activity, yet the National Weather Service radiosonde net- work is spatially coarse and suffers from temporal paucity. Supplementary information generated by numerical weather prediction (NWP) models is invaluable—analysis and forecast profiles are available at a high sampling frequency and horizontal resolution. However, numerical models con- tain inherent errors and inaccuracies, and many of these errors occur near the surface and influence the short-term...",
    "authors": "Jason Stock, John Dandy, Imme Ebert-Uphoff, Chuck Anderson, Jack Dostalek, Lewis Grasso, Jon Zeitler, Harry Weinman",
    "pdf": "",
    "conference": "AMS 101st Annual Meeting, 20th Conference on Artificial Intelligence for Environmental Science."
  },
  {
    "title": "Who's a Good Boy? Reinforcing Canine Behavior in Real-Time using Machine Learning",
    "abstract": "In this paper we outline the development methodology for an automatic dog treat dispenser which combines machine learning and embedded hardware to identify and reward dog behaviors in real-time. Using machine learning techniques for training an image classification model we identify three behaviors of our canine companions: 'sit', 'stand', and 'lie down' with up to 92% test accuracy and 39 frames per second. We evaluate a variety of neural network architectures, interpretability methods, model quantization and...",
    "authors": "Jason Stock, Tom Cavey",
    "pdf": "https://arxiv.org/abs/2101.02380",
    "conference": ""
  },
  {
    "title": "Strategies for Robust Image Classification",
    "abstract": "In this work we evaluate the impact of digitally altered images on the performance of artificial neural networks. We explore factors that negatively affect the ability of an image classification model to produce consistent and accurate results. A model's ability to classify is negatively influenced by alterations to images as a result of digital abnormalities or changes in the physical environment. The focus of this paper is to discover...",
    "authors": "Jason Stock, Andy Dolan, Tom Cavey",
    "pdf": "https://arxiv.org/abs/2004.03452",
    "conference": ""
  }
]
