[
  {
    "title": "DiffObs: Generative Diffusion for Global Forecasting of Satellite Observations",
    "abstract": "This work presents an autoregressive generative diffusion model (DiffObs) to predict the global evolution of daily precipitation, trained on a satellite observational product, and assessed with domain-specific diagnostics. The model is trained to probabilistically forecast day-ahead precipitation. Nonetheless, it is stable for multi-month rollouts, which reveal a qualitatively realistic superposition of convectively coupled wave modes in the tropics. Cross-spectral analysis confirms successful generation of low frequency variations associated with the Madden--Julian oscillation, which regulates most subseasonal to seasonal predictability in the observed atmosphere, and convectively coupled moist Kelvin waves with approximately correct dispersion relationships. Despite secondary issues and biases, the results affirm the potential for a next generation of global diffusion models trained on increasingly sparse, and increasingly direct and differentiated observations of the world, for practical applications in subseasonal and climate prediction.",
    "authors": "Jason Stock, Jaideep Pathak, Yair Cohen, Mike Pritchard, Piyush Garg, Dale Durran, Morteza Mardani, Noah Brenowitz",
    "pdf": "https://arxiv.org/abs/2404.06517",
    "poster": "files/ICLR_2024___DiffObs__Poster.pdf",
    "conference": "In ICLR 2024 Workshop Tackling on Climate Change with Machine Learning",
    "conf": ["ICLR 2024 Climate Change Workshop (Poster)"],
    "logo": "diffobs_wk.png"
  },
  {
    "title": "An Investigation of Metrics to Evaluate the Sharpness in AI-Generated Meteorological Imagery",
    "abstract": "AI-based algorithms are emerging in many meteorological applications that produce imagery as output, including for global weather forecasting models. However, the imagery produced by AI algorithms, especially by convolutional neural networks (CNNs), is often described as too blurry to look realistic, partly because CNNs tend to represent uncertainty as blurriness. This blurriness is undesirable since it might obscure important meteorological features. More complex AI models, such as generative adversarial networks (GANs) and diffusion models, generate images that appear to be sharper, but that sharpness may come at the expense of a decline in other performance criteria, such as accuracy. To choose a good trade-off between sharpness and accuracy for a specific task it is important to quantitatively assess both accuracy and sharpness. While there are numerous well-established measures for accuracy there is a lack of well-established measures for sharpness in meteorological imagery. The purpose of this paper is to fill this gap by 1) exploring a variety of sharpness metrics from other fields, 2) analyzing their suitability for meteorological applications, 3) suggesting protocols for how to use and interpret them, and 4) demonstrating their use for sample meteorological applications using vignettes.",
    "authors": "Imme Ebert-Uphoff, Lander Ver Hoef, John S. Schreck, Jason Stock, Maria J. Molina, Amy McGovern, Michael Yu, Bill Petzke, Kyle Hilburn, David M. Hall, David J. Gagne, Sam Scheuerman",
    "pdf": "https://www.ai2es.org/wp-content/uploads/2024/01/Sharpness_paper_draft_v1.pdf",
    "conference": "NSF AI Institute for Research on Trustworthy AI in Weather, Climate, and Coastal Oceanography",
    "conf": ["AI2ES (Draft)"],
    "logo": "sharpness.png"
  },
  {
    "title": "Memory-Based Sequential Attention",
    "abstract": "Computational models of sequential attention often use recurrent neural networks, which may lead to information loss over accumulated glimpses and an inability to dynamically reweigh glimpses at each step. Addressing the former limitation should result in greater performance, while addressing the latter should enable greater interpretability. In this work, we propose a biologically-inspired model of sequential attention for image classification. Specifically, our algorithm contextualizes the history of observed locations from within an image to inform future gaze points, akin to scanpaths in the biological visual system. We achieve this by using a transformer-based memory module coupled with a reinforcement learning-based learning algorithm, improving both task performance and model interpretability. In addition to empirically evaluating our approach on classical vision tasks, we demonstrate the robustness of our algorithm to different initial locations in the image and provide interpretations of sampled locations from within the trajectory.",
    "authors": "Jason Stock, Charles Anderson",
    "pdf": "https://openreview.net/forum?id=EykfhjYrM0",
    "poster": "files/neurips23-memory-seq-poster.pdf",
    "conference": "In NeurIPS 2023 Gaze Meets ML | Proceedings of Machine Learning Research 2024",
    "conf": ["NeurIPS 2023; PMLR Gaze Meets ML Workshop (Oral)"],
    "logo": "mem-seq-attn.png"
  },
  {
    "title": "Exploring the Use of Machine Learning to Improve Vertical Profiles of Temperature and Moisture",
    "abstract": "Vertical profiles of temperature and dewpoint are useful in predicting deep convection that leads to severe weather which threatens property and lives. Currently, forecasters rely on observations from radiosonde launches and numerical weather prediction (NWP) models. Radiosonde observations are, however, temporally and spatially sparse, and NWP models contain inherent errors that influence short-term predictions of high impact events. This work explores using machine learning (ML) to postprocess NWP model forecasts, combining them with satellite data to improve vertical profiles of temperature and dewpoint. We focus on different ML architectures, loss functions, and input features to optimize predictions. Because we are predicting vertical profiles at 256 levels in the atmosphere, this work provides a unique perspective at using ML for 1-D tasks. Compared to baseline profiles from the Rapid Refresh (RAP), ML predictions offer the largest improvement for dewpoint, particularly in the mid- and upper-atmosphere. Temperature improvements are modest, but CAPE values are improved by up to 40%. Feature importance analyses indicate that the ML models are primarily improving incoming RAP biases. While additional model and satellite data offer some improvement to the predictions, architecture choice is more important than feature selection in fine-tuning the results. Our proposed deep residual UNet performs the best by leveraging spatial context from the input RAP profiles; however, the results are remarkably robust across model architecture. Further, uncertainty estimates for every level are well-calibrated and can provide useful information to forecasters.",
    "authors": "Katherine Haynes, Jason Stock, Jack Dostalek, Charles Anderson, Imme Ebert-Uphoff",
    "pdf": "https://journals.ametsoc.org/view/journals/aies/aop/AIES-D-22-0090.1/AIES-D-22-0090.1.xml",
    "conference": "Artificial Intelligence for the Earth Systems (AIES)",
    "conf": ["AIES 2023 (Journal)"],
    "logo": "vertical_profile_uq.png"
  },
  {
    "title": "Attention-Based Scattering Network for Satellite Imagery",
    "abstract": "Multi-channel satellite imagery, from stacked spectral bands or spatiotemporal data, have meaningful representations for various atmospheric properties. Combining these features in an effective manner to create a performant and trustworthy model is of utmost importance to forecasters. Neural networks show promise, yet suffer from unintuitive computations, fusion of high-level features, and may be limited by the quantity of available data. In this work, we leverage the scattering transform to extract high-level features without additional trainable parameters and introduce a separation scheme to bring attention to independent input channels. Experiments show promising results on estimating tropical cyclone intensity and predicting the occurrence of lightning from satellite imagery.",
    "authors": "Jason Stock, Charles Anderson",
    "pdf": "https://arxiv.org/abs/2210.12185",
    "conference": "In NeurIPS 2022 Workshop Tackling on Climate Change with Machine Learning | AMS 103rd Annual Meeting, 22nd Conference on Artificial Intelligence for Environmental Science",
    "conf": ["NeurIPS 2022 Climate Change Workshop (Poster)", "AMS AI 2023 (Oral)"],
    "logo": "atten_scattering_network.png"
  },
  {
    "title": "An Interpretable Model of Climate Change Using Correlative Learning",
    "abstract": "Determining changes in global temperature and precipitation that may indicate climate change is complicated by annual variations. One approach for finding potential climate change indicators is to train a model that predicts the year from annual means of global temperatures and precipitations. Such data is available from the CMIP6 ensemble of simulations. Here a two-hidden-layer neural network trained on this data successfully predicts the year. Differences among temperature and precipitation patterns for which the model predicts specific years reveal changes through time. To find these optimal patterns, a new way of interpreting what the neural network has learned is explored. Alopex, a stochastic correlative learning algorithm, is used to find optimal temperature and precipitation maps that best predict a given year. These maps are compared over multiple years to show how temperature and precipitations patterns indicative of each year change over time.",
    "authors": "Charles Anderson, Jason Stock",
    "pdf": "https://arxiv.org/abs/2212.04478",
    "conference": "In NeurIPS 2022 Workshop Tackling on Climate Change with Machine Learning | AMS 103rd Annual Meeting, 22nd Conference on Artificial Intelligence for Environmental Science",
    "conf": ["NeurIPS 2022 Climate Change Workshop (Poster)"],
    "logo": "cmip6_alopex.png"
  },
  {
    "title": "Trainable Wavelet Neural Network for Non-Stationary Signals",
    "abstract": "This work introduces a wavelet neural network to learn a filter-bank specialized to fit non-stationary signals and improve interpretability and performance for digital signal processing. The network uses a wavelet transform as the first layer of a neural network where the convolution is a parameterized function of the complex Morlet wavelet. Experimental results, on both simplified data and atmospheric gravity waves, show the network is quick to converge, generalizes well on noisy data, and outperforms standard network architectures.",
    "authors": "Jason Stock, Charles Anderson",
    "pdf": "https://arxiv.org/abs/2205.03355",
    "poster": "files/stock-cs793-F2021-compressed.pdf",
    "conference": "AI for Earth and Space Science Workshop at the International Conference on Learning Representations",
    "conf": ["ICLR 2022 AI4Earth Workshop (Oral)"],
    "logo": "trainable_wavelet_1.png"
  },
  {
    "title": " Interpretable Climate Change Modeling with Progressive Cascade Networks",
    "abstract": "Typical deep learning approaches to modeling high-dimensional data often result in complex models that do not easily reveal a new understanding of the data. Research in the deep learning field is very actively pursuing new methods to interpret deep neural networks and to reduce their complexity. An approach is described here that starts with linear models and incrementally adds complexity only as supported by the data. An application is shown in which models that map global temperature and precipitation to years are trained to investigate patterns associated with changes in climate.",
    "authors": "Charles Anderson, Jason Stock, David Anderson",
    "pdf": "https://arxiv.org/abs/2205.06351",
    "conference": "AI for Earth and Space Science Workshop at the International Conference on Learning Representations",
    "conf": ["ICLR 2022 AI4Earth Workshop (Poster)"],
    "logo": "progressive_cascade_nets_1.png"
  },
  {
    "title": "CIRA Guide to Custom Loss Functions for Neural Networks in Environmental Sciences",
    "abstract": "Neural networks are increasingly used in environmental science applications. Furthermore, neural network models are trained by minimizing a loss function, and it is crucial to choose the loss function very carefully for environmental science applications, as it determines what exactly is being optimized. Standard loss functions do not cover all the needs of the environmental sciences, which makes it important for scientists to be able to develop their own custom loss functions so that they can implement many of the classic performance measures already developed in environmental science, including...",
    "authors": "Imme Ebert-Uphoff, Ryan Lagerquist, Kyle Hilburn, Yoonjin Lee, Katherine Haynes, Jason Stock, Christina Kumler, Jebb Q. Stewart",
    "pdf": "https://arxiv.org/abs/2106.09757",
    "conference": "arXiv Preprint 2021",
    "conf": ["AMS AI 2022 (Oral)", "3rd NOAA AI Workshop 2021 (Oral)"],
    "logo": "cira_loss_1.png"
  },
  {
    "title": "Using Machine Learning to Improve Vertical Profiles of Temperature and Moisture for Severe Weather Nowcasting",
    "abstract": "Vertical profiles of temperature and moisture as provided by radiosondes are of paramount importance to forecasting convective activity, yet the National Weather Service radiosonde network is spatially coarse and suffers from temporal paucity. Supplementary information generated by numerical weather prediction (NWP) models is invaluable—analysis and forecast profiles are available at a high sampling frequency and horizontal resolution. However, numerical models contain inherent errors and inaccuracies, and many of these errors occur near the surface and influence the short-term...",
    "authors": "Jason Stock, John Dandy, Imme Ebert-Uphoff, Chuck Anderson, Jack Dostalek, Lewis Grasso, Jon Zeitler, Harry Weinman",
    "pdf": "https://mountainscholar.org/handle/10217/233704",
    "poster": "files/stock-cs793-S2021-compressed.pdf",
    "conference": "AMS 101st Annual Meeting, 20th Conference on Artificial Intelligence for Environmental Science.",
    "conf": ["AMS AI 2021 (Oral)", "3rd NOAA AI Workshop 2021 (Oral)"],
    "logo": "soundings_1.png"
  },
  {
    "title": "Who's a Good Boy? Reinforcing Canine Behavior in Real-Time using Machine Learning",
    "abstract": "In this paper we outline the development methodology for an automatic dog treat dispenser which combines machine learning and embedded hardware to identify and reward dog behaviors in real-time. Using machine learning techniques for training an image classification model we identify three behaviors of our canine companions: 'sit', 'stand', and 'lie down' with up to 92% test accuracy and 39 frames per second. We evaluate a variety of neural network architectures, interpretability methods, model quantization and...",
    "authors": "Jason Stock, Tom Cavey",
    "pdf": "https://arxiv.org/abs/2101.02380",
    "conference": "arXiv Preprint 2021",
    "conf": ["arXiv Preprint 2021"],
    "logo": "whos_a_good_boy_1.png"
  },
  {
    "title": "Strategies for Robust Image Classification",
    "abstract": "In this work we evaluate the impact of digitally altered images on the performance of artificial neural networks. We explore factors that negatively affect the ability of an image classification model to produce consistent and accurate results. A model's ability to classify is negatively influenced by alterations to images as a result of digital abnormalities or changes in the physical environment. The focus of this paper is to discover...",
    "authors": "Jason Stock, Andy Dolan, Tom Cavey",
    "pdf": "https://arxiv.org/abs/2004.03452",
    "conference": "arXiv Preprint 2020",
    "conf": ["arXiv Preprint 2020"],
    "logo": "robust_1.png"
  }
]
